* Barnes_T061_1977

#+NAME: ingest_meta
#+BEGIN_SRC bash :results verbatim :exports results
cat meta.bsv | sed 's/|/@| /' | column -s"@" -t
#+END_SRC

#+RESULTS: ingest_meta
#+begin_example
Borehole ID                      | Barnes_T061_1977
Place name                       | Barnes Ice Cap
Geographic location              | Canadian Arctic South
Ice type                         | Ice cap
Data Source                      | Graphic in science source
Data DOI                         | 
Science Source                   | Hooke, Roger LeB., Alexander, E. Calvin, Gustafson, Robert J.: Temperature profiles in the Barnes Ice Cap, Baffin Island, Canada, and heat flux from the subglacial terrane , Canadian Journal of Earth Sciences 17(9), Canadian Science Publishing, 1174–1188, sep 1980
Science DOI                      | 10.1139/e80-124
Date                             | 1977-06-15
Longitude [°E]                   | -71.9703
Latitude [°N]                    | 69.78899
Location Source                  | Location digitized by M. Jacquemart from Gilbert (2016) and Hooke (1980)
Depth of top measurement [m]     | 0.0
Depth of bottom measurement [m]  | 217
Ice thickness [m]                | 239
Coverage [% of thickness]        | 91
Ice thickness source             | Hooke, Roger LeB., Alexander, E. Calvin, Gustafson, Robert J.: Temperature profiles in the Barnes Ice Cap, Baffin Island, Canada, and heat flux from the subglacial terrane , Canadian Journal of Earth Sciences 17(9), Canadian Science Publishing, 1174–1188, sep 1980
Note                             | "Date is ""Date completed"" from Hooke (1980) Table 1 Column 2 + Days to final measurement (Column 3); Location digitized by M. Jacquemart"
#+end_example


** Temperature

+ Any notes on source or data
+ Links to key papers

** Thickness

+ Notes on thickness
 
** Location

+ Notes on location

** Data                                                 :noexport:

#+NAME: ingest_data
#+BEGIN_SRC bash :exports results
(head -n1 data.csv && tail -n +2 data.csv | sort -t, -n -k2)
#+END_SRC

#+RESULTS: ingest_data
|          t |         d |
| -11.115337 |         0 |
| -10.703068 | 20.515362 |
| -10.385276 | 37.462833 |
|  -9.887116 |  63.92468 |
|  -9.234356 | 90.089195 |
|  -8.426994 | 124.28146 |
| -7.6969323 | 160.55501 |
| -7.0957055 | 191.47672 |
| -6.6920247 |  217.3439 |


